**Topic**

* Replace from Multiple Column
* Row Values to Column Names (Pivot Table)
* Mapping (Many to One)

In [ ]:
import pandas as pd

# **Replace from Multiple Column**

In [ ]:
import pandas as pd
import numpy as np
df = {'INR': ['4,200','5,000',0,'4,353','6,000',1],
'USD':['4,100','3,000','1,000','4,353','6,000',1]}
df = pd.DataFrame(df)
df

     INR    USD
0  4,200  4,100
1  5,000  3,000
2      0  1,000
3  4,353  4,353
4  6,000  6,000
5      1      1

In [ ]:
df[['INR','USD']]=df[['INR','USD']].replace(',','', regex=True)
df

    INR   USD
0  4200  4100
1  5000  3000
2     0  1000
3  4353  4353
4  6000  6000
5     1     1

# **Row Values to Column Names (Pivot Table)**

In [ ]:
data = ('State         AwardYear    0\n'
'Alabama        2003      89\n'
'Alabama        2004      92\n'
'Alabama        2005      108\n'
'Alabama        2006      81\n'
'Alabama        2007      71\n'
'Wyoming        2011      4\n'
'Wyoming        2012      2\n'
'Wyoming        2013      1\n'
'Wyoming        2014      4\n'
'Wyoming        2015       3\n')

In [ ]:
from io import StringIO
df = pd.read_fwf(StringIO(data))
df

     State  AwardYear    0
0  Alabama       2003   89
1  Alabama       2004   92
2  Alabama       2005  108
3  Alabama       2006   81
4  Alabama       2007   71
5  Wyoming       2011    4
6  Wyoming       2012    2
7  Wyoming       2013    1
8  Wyoming       2014    4
9  Wyoming       2015    3

In [ ]:
df2 = pd.pivot_table(df,values='0', columns='AwardYear', index=['State'])
df2

AwardYear  2003  2004   2005  2006  2007  2011  2012  2013  2014  2015
State
Alabama    89.0  92.0  108.0  81.0  71.0   NaN   NaN   NaN   NaN   NaN
Wyoming     NaN   NaN    NaN   NaN   NaN   4.0   2.0   1.0   4.0   3.0

# **Mapping (Many to One)**

In [ ]:
df = {'Terrain': ['M1','M2','F','G','S','B1','B2']}
df = pd.DataFrame(df)
df

  Terrain
0      M1
1      M2
2       F
3       G
4       S
5      B1
6      B2

In [ ]:
L1 = ['M1','M2','B1','B2']
d1 = dict.fromkeys(L1, 'Composite')

L2 = ['F','G']
d2 = dict.fromkeys(L2, 'Gravel')

L3 = ['S']
d3 = dict.fromkeys(L3, 'Sod')

d = {**d1, **d2, **d3}
d

{'B1': 'Composite',
 'B2': 'Composite',
 'F': 'Gravel',
 'G': 'Gravel',
 'M1': 'Composite',
 'M2': 'Composite',
 'S': 'Sod'}

In [ ]:
df['Terrain_Type'] = df['Terrain'].map(d)
df

  Terrain Terrain_Type
0      M1    Composite
1      M2    Composite
2       F       Gravel
3       G       Gravel
4       S          Sod
5      B1    Composite
6      B2    Composite